app/controllers/customers_controller.rb

  def create
    @customer = Customer.create(customer_params)
---
INSERT INTO "customers" ("first_name", "last_name", "phone", "email", "street", "zip", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE "customers" SET "last_name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["last_name", "last 1234"], ["updated_at", "2017-03-22 10:57:37.483547"], ["id", 8]]